Documents/ЗаявлениеНаПрименениеЛьготы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаПрименениеЛьготы</Name>
			<Comment>(регл)</Comment>
			<BasedOn>
				<xr:Item>Document.ПриемНаРаботуВОрганизацию</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛьготыРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Льгота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЛьготРаботниковОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзменения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актуальность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛьготыРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЛьготыРаботниковОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛьготРаботниковОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявлениеНаПрименениеЛьготы/Ext/ObjectModule.bsl
Перем мУдалятьДвижения;

#Если Клиент Тогда

// Функция формирует табличный документ с печатной формой "П6",
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьЗаявления() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ДатаНК = ПроведениеРасчетов.ДатаВводаНК();
	
	//// ВЫВОД ДАННЫХ В ОТЧЕТ
	Выборка = СформироватьЗапросПоДокументу().Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДатаИзменения < ДатаНК Тогда
			Макет = ПолучитьМакет("Заявление");
		Иначе
			Макет = ПолучитьМакет("Заявление2011");
		КонецЕсли;
		
		ОбластьШапка1 = Макет.ПолучитьОбласть("Шапка1");
		ОбластьШапка1.Параметры.Заполнить(Выборка);
		ТабДокумент.Присоединить(ОбластьШапка1);
	
		ОбластьДРФО = Макет.ПолучитьОбласть("ДРФО");
		ТабДокумент.Присоединить(ОбластьДРФО);
		Счетчик = 1; 
		Пока Счетчик < 11 Цикл
			ОбластьДРФО = Макет.ПолучитьОбласть("КодПоДРФО" + Строка(Счетчик));	
			КодПоДРФО = Сред(Выборка.ФизЛицо.КодпоДРФО, Счетчик, 1);
			Если Номер <> Неопределено Тогда
				ОбластьДРФО.Параметры.Номер = КодПоДРФО;
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьДРФО);
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
		Областьшапка2.Параметры.Заполнить(Выборка);
		ТабДокумент.Присоединить(ОбластьШапка2);		
		
		Если Выборка.Актуальность Тогда
			ОбластьЗаявление = Макет.ПолучитьОбласть("ПрименениеЛьготы");
			Если Выборка.ДатаИзменения < ДатаНК Тогда
				ОбластьЗаявление.Параметры.Норма = Выборка.Льгота.ПунктЗаконаНДФЛ;
			Иначе
				КодЛьготы = СтрЗаменить(Выборка.Льгота.Код,"ВР","");
				ОбластьЗаявление.Параметры.Норма = КодЛьготы;
			КонецЕсли;
			ОбластьЗаявление.Параметры.Дата = Формат(Дата,"Л=uk; ДФ='дд ММММ гггг'");
			ТабДокумент.Присоединить(ОбластьЗаявление);
		Иначе
			ОбластьЗаявление = Макет.ПолучитьОбласть("ОтказОтЛьготы");
			ОбластьЗаявление.Параметры.Месяц =  Формат(Выборка.ДатаИзменения,"Л=uk; ДФ=ММММ");
			ОбластьЗаявление.Параметры.Год2 = Прав(Формат(выборка.ДатаИзменения,"ДФ=гггг"), 1);
			ОбластьЗаявление.Параметры.Год1 = Сред(Формат(выборка.ДатаИзменения,"ДФ=гггг"), 3,1);
			ОбластьЗаявление.Параметры.Дата = Формат(Дата,"Л=uk; ДФ='дд ММММ гггг'");
			ТабДокумент.Присоединить(ОбластьЗаявление);
		КонецЕсли;
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	

	
	Возврат ТабДокумент;
	
КонецФункции // 

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	// Получить экземпляр документа на печать
	Если  ИмяМакета = "ПечатьЗаявления" Тогда
		ТабДокумент = ПечатьЗаявления()
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер,ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,НСтр("ru='Заявление на применение (отказ от) налоговой социальной льготы ';uk='Заява на застосування (відмова від) податкової соціальної пільги'")));

КонецФункции // Печать

#КонецЕсли

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	Возврат Новый Структура("ПечатьЗаявления",НСтр("ru='Печать заявления';uk='Друк заяви'"));		
КонецФункции

Функция  СформироватьЗапросПоДокументу()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаявлениеРаботникиОрганизации.Ссылка.Организация	КАК Организация,
	|	ЗаявлениеРаботникиОрганизации.Ссылка.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
	|	ЗаявлениеРаботникиОрганизации.Сотрудник				КАК Сотрудник,
	|	ЗаявлениеРаботникиОрганизации.Сотрудник.ФизЛицо 	КАК ФизЛицо,
	|	ЗаявлениеРаботникиОрганизации.Льгота				КАК Льгота,
	|	ЗаявлениеРаботникиОрганизации.ДатаИзменения			КАК ДатаИзменения,
	|	ЗаявлениеРаботникиОрганизации.Актуальность 			КАК Актуальность,
	|	РаботникиОрганизаций.Должность						КАК Должность,
	|	ЕСТЬNULL(ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество, ФизЛицо.Наименование) КАК ФИО	
	|ИЗ
	|	Документ.ЗаявлениеНаПрименениеЛьготы.РаботникиОрганизации КАК ЗаявлениеРаботникиОрганизации
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ФИОФизЛиц.СрезПоследних(&МоментВремени) КАК ФИОФизЛиц
	|ПО
	|	ЗаявлениеРаботникиОрганизации.Сотрудник.ФизЛицо = ФИОФизЛиц.ФизЛицо
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&МоментВремени) КАК РаботникиОрганизаций
	|ПО
	|	ЗаявлениеРаботникиОрганизации.Сотрудник = РаботникиОрганизаций.Сотрудник
	|	И ЗаявлениеРаботникиОрганизации.Ссылка.Организация	= РаботникиОрганизаций.Организация
	|ГДЕ
	|	ЗаявлениеРаботникиОрганизации.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявлениеРаботникиОрганизации.Актуальность УБЫВ,
	|	ЗаявлениеРаботникиОрганизации.Сотрудник.Наименование
	|";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос;
	
КонецФункции

Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст = "
	|Выбрать 
	|	Дата, 
	|	Организация,
	| 	Ссылка 
	|Из 
	|	Документ." + Метаданные().Имя + "
	|Где 
	|	Ссылка = &ДокументСсылка
	|";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

Функция СформироватьЗапросПоРаботникиОрганизации()

	Запрос = Новый Запрос;
	
	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);

	ТекстЗапроса = "
	|	ВЫБРАТЬ
	|	ТЧРаботникиОрганизации.НомерСтроки				КАК НомерСтроки,
	|	ТЧРаботникиОрганизации.Ссылка.Организация			КАК Организация,
	|	ТЧРаботникиОрганизации.Льгота,
	|	ТЧРаботникиОрганизации.Сотрудник,
	|	ТЧРаботникиОрганизации.Актуальность			КАК Актуальность,
	|	ТЧРаботникиОрганизации.ДатаИзменения КАК ДатаИзменения
	|
	|ИЗ	Документ." + Метаданные().Имя + ".РаботникиОрганизации КАК ТЧРаботникиОрганизации
	|	
	|ГДЕ	ТЧРаботникиОрганизации.Ссылка = &ДокументСсылка
	|	
	|";			   
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();

КонецФункции


Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указана организация, в которой работает работник!';uk='Не зазначена організація, у якій працює працівник!'"), Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

Процедура ПроверитьЗаполнениеСтрокиРаботникиОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ)

	СтрокаНачалаСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В строке номер ""%1"" табл. части ""Работники организации"": ';uk='У рядку номер ""%1"" табл. частини ""Працівники організації"": '"), СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки));
	
	// Сотрудник
	Если Не ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не выбран Работник!';uk='не обраний Працівник!'"), Отказ);
	КонецЕсли;
	
	// Льгота
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Льгота) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указан вид льготы!';uk='не зазначений вид пільги!'"), Отказ);
	КонецЕсли;
	
  	// ДатаИзменения
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.ДатаИзменения) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не указана дата изменения !';uk='не вказана дата зміни !'"), Отказ);
	КонецЕсли;
		
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПриемНаРаботуВОрганизацию") Тогда
		Организация = Основание.Организация;
		Ответственный = Основание.Ответственный;
		Для каждого СтрокаОснования Из Основание.РаботникиОрганизации Цикл
	      СтрокаРаботники = РаботникиОрганизации.Добавить();
		  
		  СтрокаРаботники.Сотрудник     = СтрокаОснования.Сотрудник;
		  СтрокаРаботники.Льгота        = Справочники.ВидыЛьготРаботниковОрганизаций.НДФЛ_611;
		  СтрокаРаботники.ДатаИзменения = СтрокаОснования.ДатаПриема;
		  СтрокаРаботники.Актуальность  = Истина;
	   КонецЦикла;		
	
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ)
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();
	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
  	ВыборкаПоШапкеДокумента.Следующий();
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	Если НЕ Отказ Тогда
		// получим реквизиты табличной части
		РезультатЗапросаПоРаботники = СформироватьЗапросПоРаботникиОрганизации();
		ВыборкаПоРаботникиОрганизации = РезультатЗапросаПоРаботники.Выбрать();
		
		Пока ВыборкаПоРаботникиОрганизации.Следующий() Цикл 
			
			// проверим очередную строку табличной части
			ПроверитьЗаполнениеСтрокиРаботникиОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации, Отказ);
			
			Если НЕ Отказ Тогда
	
				Движение = Движения.ЛьготыРаботниковОрганизаций.Добавить();
			
				Движение.Организация	= ВыборкаПоШапкеДокумента.Организация;
				Движение.Сотрудник		= ВыборкаПоРаботникиОрганизации.Сотрудник;
				Движение.Льгота			= ВыборкаПоРаботникиОрганизации.Льгота;
				Движение.Период			= ВыборкаПоРаботникиОрганизации.ДатаИзменения;
				Движение.Актуальность	= ВыборкаПоРаботникиОрганизации.Актуальность;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации);
	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицоПоТЧ(РаботникиОрганизации);
	
	мУдалятьДвижения = НЕ ЭтоНовый();	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
